# CannotCreateArraySelectionIsGrouped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures..::..CannotCreateArraySelectionIsGrouped Property
BuiltInFailures..::..ArrayFailures Class See Also
---
Can't create an array because the selection cannot be grouped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateArraySelectionIsGrouped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateArraySelectionIsGrouped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateArraySelectionIsGrouped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ArrayFailures Class
Autodesk.Revit.DB Namespace